app/views/users/new.html.erb

SELECT  "users".* FROM "users" WHERE "users"."token" IS NULL LIMIT 1
---

        infos.forEach(function(hash) {
          var name = 'input_' + count + '_token';
          var input_token = document.createElement('input');
          input_token.type = 'hidden';
          input_token.name = "user[pages][][" + name + "]";
          input_token.value = hash.token;

          var name = 'input_' + count + '_url';
          var input_url = document.createElement('input');
          input_url.type = 'hidden';
          input_url.name = "user[pages][][" + name + "]";
          input_url.value = hash.url;

          var name = 'input_' + count + '_dateTime';
          var input_dateTime = document.createElement('input');
          input_dateTime.type = 'hidden';
          input_dateTime.name = "user[pages][][" + name + "]";
          input_dateTime.value = hash.dateTime;

          var name = 'input_' + count + '_page';
          var input_page = document.createElement('input');