app/views/users/show.html.erb

SELECT "pages".* FROM "pages" WHERE "pages"."user_id" = ?  [["user_id", 1]]
---
  <ul>
    <% @user.pages.each do |page| %>