app/controllers/users_controller.rb

  def create
    @user = User.find_or_initialize_by(email: user_params[:email])

    if @user.new_record?
      @user.token = user_params[:token]
      @user.name = user_params[:name]
    end

    if !@user.new_record? || @user.save
      previous = !@user.pages.blank? ? @user.pages.last.page : ''
      pages = params[:user][:pages]
      number_of_records = pages.size / 4

      (0..(number_of_records - 1)).each do |index|
        @user.pages.create(url: pages["input_#{ index }_url"], date_time: pages["input_#{ index }_dateTime"], page: pages["input_#{ index }_page"]) unless previous == pages["input_#{ index }_page"]

        previous = pages["input_#{ index }_page"]
      end

      session[:user] = @user.token
      cookies[:user] = @user.token
    end

    respond_to do |format|
      if @user.errors.blank?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "Novo"]]
SELECT  "pages".* FROM "pages" WHERE "pages"."user_id" = ?  ORDER BY "pages"."id" DESC LIMIT 1  [["user_id", 1]]
SELECT "pages".* FROM "pages" WHERE "pages"."user_id" = ?  [["user_id", 1]]
INSERT INTO "pages" ("url", "date_time", "page", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("name", "email", "token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."token" = ? LIMIT 1  [["token", "2b7339c4eb0270363da4cf3bc51932235f09053f48b07513424f4b4a288d4816"]]

  def page
    page = params[:user][:pages]
    @user = User.find_by(token: page['input_0_token'])

    if @user.present
      previous = @user.pages.last.page

      @user.pages.create(url: page["input_0_url"], date_time: page["input_0_dateTime"], page: page["input_0_page"]) unless previous == page["input_0_page"]
---
SELECT  "users".* FROM "users" WHERE "users"."token" = ? LIMIT 1  [["token", "2b7339c4eb0270363da4cf3bc51932235f09053f48b07513424f4b4a288d4816"]]
SELECT  "pages".* FROM "pages" WHERE "pages"."user_id" = ?  ORDER BY "pages"."id" DESC LIMIT 1  [["user_id", 1]]
INSERT INTO "pages" ("url", "date_time", "page", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)